# **Assignment Create Data frames using Dictionary**

**29th Feb**

In [83]:
import pandas as pd   # Data frame operations

# **Create dataframes using dictionary**

**Step-1**

$Create$ $DataFrame$

In [84]:
d1={"NAME":['Ahmed','Zeeshan','Abrar'],
    "AGE":[30,35,40]}

pd.DataFrame(d1)

      NAME  AGE
0    Ahmed   30
1  Zeeshan   35
2    Abrar   40

**Step-2**

$Provide$ $index$

In [85]:
ind=('A','B','C')
pd.DataFrame(d1,index=ind)

      NAME  AGE
A    Ahmed   30
B  Zeeshan   35
C    Abrar   40

**Step-3**

$Add$ $New$ $Column$

In [86]:
d1={"NAME":['Ahmed','Zeeshan','Abrar'],
    "AGE":[30,35,40],
   "CITY":['MBNR','GDWL','GNTR']}
pd.DataFrame(d1,index=ind)

      NAME  AGE  CITY
A    Ahmed   30  MBNR
B  Zeeshan   35  GDWL
C    Abrar   40  GNTR

**Step-4**

$update$ $the$ $exsisting$ $column$

In [87]:
d1['NAME']=['Sufiyan','Shoaib','Hussain']
pd.DataFrame(d1,index=ind)

      NAME  AGE  CITY
A  Sufiyan   30  MBNR
B   Shoaib   35  GDWL
C  Hussain   40  GNTR

**Step-5**

$Drop$ $the$ $column$

In [88]:
df=pd.DataFrame(d1,index=ind)
df.drop('CITY',axis=1,inplace=True)
df

      NAME  AGE
A  Sufiyan   30
B   Shoaib   35
C  Hussain   40

**Step-6**

$Drop$ $Row$

In [89]:
df=pd.DataFrame(d1,index=ind)
df.drop('C',axis=0,inplace=True)
df

      NAME  AGE  CITY
A  Sufiyan   30  MBNR
B   Shoaib   35  GDWL

**Step-7**

$Save$ $The$ $Data$ $Frame$

In [90]:
df.to_csv("ASS_EDA_1.csv")
df.to_excel("ASS_EDA_1.xlsx")

In [91]:
pd.read_csv("ASS_EDA_1.csv")

  Unnamed: 0     NAME  AGE  CITY
0          A  Sufiyan   30  MBNR
1          B   Shoaib   35  GDWL

**Step-8**

$Remove$ $the$ $index$

In [92]:
df.to_csv("ASS_EDA_1.csv",index=False)

In [93]:
pd.read_csv("ASS_EDA_1.csv")

      NAME  AGE  CITY
0  Sufiyan   30  MBNR
1   Shoaib   35  GDWL